1강 - 영상강시 분야에서의 AI 얼굴인식, 영상인식 및 처리 탑재 기술과 서비스 적용방안

- 이상징후 검출 기술
   . 기계학습/딥러닝 기반 이상징후 검출 기술 개발
   . 타입랩스를 이용한


A. 3D(시/공간) 특징을 이용한 기계학습/딥러닝 기반 이상징후 분류 모델 향상

- 동일 객체 재인식 기술
- 엣지 카메라의 중첩된 경계영역에서 검출된 관심 동일 객체 재인식 알고리즘 개발
- CNN기반 동일 객체 재인식 알고리즘
- 기존의 GoogleNet~

등으로 동일객체인지 아닌지 판단

-관심 객체 및 이상 징후 검색을 위한 객체 메타데이터 생성 및 저장 기술
A. 메타데이터 생성 기술
1. PLSA model 기반의 color name 학습을 통한 객체 색상 메타데이터 생성 기술
2. two-stream 시반의 딥러닝 네트워크를 이용한 이상징후 메타데이터 생성
B. 저장된 메타데이터를 이용한 검색 기술
1. SQL 이용

-영상 분석 시스템-엣지카메라 협업을 위한 연동 인터페이스


-영상 분석 시스템-엣지 카메라 협업 의사결정 알고리즘 개발 (완료)
.영상 분석 시스템-엣지 카메라간 협업을 위한 학습형 의사결정 알고리즘 개발


2강 - 드론분야ㅐ에서의 AI 영상인식 및 처리 탑재기술과 서비스 적용방안
- 2001년부터 20년간 비전관련 드론기술을 연구함

(1) 연구실 소개 : 항공우주시스템 공학부
(2) 드론내의 자료는 다 보안으로 공유가 안된다 그래서 모든걸 자체 개발하는중이다
(3) 영상인식은 결국 : 타겟 인식과 트래킹
드론은 전파 손실이 심해서 영상인식으로 트래킹하는 것이 중요

3강 - 자율주행차 분야에서의 AI 얼굴인식, 영상인식 및 처리 탑재기술과 서비스 적용방안

- 볼게 없음...

4강 - 스마트팩토리 분야에서의 AI 얼굴인식, 영상인식 및 처리 탑재기술과 서비스 적용방안


- 스마트 팩토리 에코시스템
 : 양품의 품질 생산 -
1단계 : 자동화 통한 효율화
2단계 : 검사


비전검사 자동화

-> 보급률 1위는 자동차 ->반도체
꼴찌는 가죽


기존 룰베이스 방식의 문제 : 빈번한 Rule 설정 필요

feature 정의, shape 정의 등등이 너무 어렵다.


딥러닝은 러닝베이스


Image Comparision

Diff-Net을 적용하여 불량 이미지와 정상이미지간을 Pair로 학습시켜서 다른점을 찾는 방식을 사용한다.

Domain adaptation을 적용
- 이 방법은 새로운 이미지가 오면, 즉 소수 이미지를 가지고 학습

GAN은 비정규성 이미지에서는 성능이 좋지 않다.


post training??? 추후 볼 것

5강 - AR/VR 분야에서 AI 얼굴인식, 영상인식 및 처리 탑재기술과 서비스 적용방안

- AI engine : 카메라/센서 입력으로부터
- AR engine : 실제에 가상물체 합성


AR을 넣을때 실제 환경에 맞게 customize


얼굴인식에 손동작 인식등을 결합하여 결제서비스까지 가능하도록 설계

얼굴인식을 2D가 아닌 3D 정보를 얻도록 노력 -> 현실감있는 AR을 위해서


Face detection -> Face Landmark estimation(regression) -> Face alignment -> emd

Megaface DB
KISA (한국인터넷진흥원) 인증완료
NIST (미국국립표준과학연구소) 평가 진행 중 (Pre 결과 진행중)

land mark의 수를 찾는 문제 -> 160개에서 22개로 확장중



사용된 딥러닝 기술 : Fully convolutional Networks

피씨에서는 3ms
엑시노스 8895 갤럭시 S8 7ms


3D header pose


요새는 large margin loss를 많이 사용
angular margin loss도 사용

FRVT : 얼굴인식 대회
cluster purity : 전체에서 구분된 클러스터가 얼마나 순수한지를 보여주는 지표

표정인식 : 긍정, 중립, 부정 -> 색별로 표정인식하여 제공


Hand analysis
손 검출 : 영상 내에서 손의 bounding box를 찾기
2D 손 골격: (Skeleton) 검출 :

최종단계는 Hand analysis AR과 인터랙티브하게 적용


6강 - 패션/커머스 분야에서의 AI 얼굴인식, 영상인식 및 처리 탑재기술과 서비스 적용방안

- AI로 옷을 개발
2019 CES에서 이커머스 기술 혁신 로드맵에서 AI를 중심으로 상품 제조부터 개인화된 비서 수준의 서비스까지 모든 영역에서~~~


전자상거래 관련 인공지능 기술을 도입한 주요 회사들과 분야들을 구분한다면 기초기술을 중심으로 연구하는 그룹과 응용서비스를 개발하는 그룹으로 나뉨


데이터 분석관점에서는 3개로 구분되어 진행됨


1 supervised
2 unsupervised
3 reinforcement learning

옷도 레이블할때 여러 단계로 나누어서 레이블한다.

1) 긴팔, 반팔, 몸통 등
즉, 여러 속성으로 나누어서 적용한다.


즉, sleeve, color, collar, pattern, material등으로 분류


상품화 설계는 결국

1) 데이터 취득 - 웹크롤링, 전처리(blurring 등), 
2) 데이터 레이블링 -  상세 레이블 스펙 날씨 등
3) 데이터 deployment - hardware optimization, 병렬 처리 등

안드로이드 오토 연결시 -> slam으로 차량 물체의 위치를 추적후 결제 - 인증 - 인식???


이커머스의 예측 모델의 유효성
- 특정 상품에 대하여 지금부터 18개월 이후 시점까지의 수요를 예측

- 기술적 과제들(Challenges)
  => Sparsity, Size, Seasonal, Distribution, Scale, Censored 등


7강 - 의료 분야에서의 AI 얼굴인식, 영상인식 및 처리 탑재기술과 서비스 적용 방안
- 데이터 드리븐 방식의 설계
 => 데이터 사이언티스트의 역할이 강화됨

- problem definition
  : Discovering Unmet Needs
  - prevention -> screening -> Diagnosis -> treatment -> monitoring


Fast MRI -> MRI는 자기공명 데이터로부터 reconstruction되는 데이터를 만드는 것인데, 이는 비싸고 촬영 시간이 오래걸리기 떄문에
띄엄띄엄 자기공명데이터를 촬영하고 이로부터 gan을 사용하여 MRI 데이터를 생성하는 방식이다.
-> 페이스북이랑 미국 대학이랑 연구 진행함

- Data annotation관련 많은 특허 존재







